In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('images.db')
c = conn.cursor()

In [3]:
# c.execute('SELECT * FROM images')
# data = c.fetchall()
# print(data)
# for row in data:
# #     print(row)

In [4]:
pd.read_sql_query("SELECT * from images", conn)

                         name class  classified
0    20200102T010028_VOOR.jpg  Rain           1
1    20200102T030029_VOOR.jpg  Rain           1
2    20200102T100028_VOOR.jpg  Rain           1
3    20200102T112026_VOOR.jpg  Rain           1
4    20200102T112527_VOOR.jpg  Rain           1
..                        ...   ...         ...
137  20200102T224028_VOOR.jpg  None           0
138  20200102T230029_VOOR.jpg  None           0
139  20200102T080028_VOOR.jpg  None           0
140  20200102T020029_VOOR.jpg  None           0
141  20200102T060029_VOOR.jpg  None           0

[142 rows x 3 columns]